app/Views/dashboard/addKaskecil.php

            <?= csrf_field(); ?>
            <?php
            $kasKecilModel = new \App\Models\KasKecilModel();
            $valNumb = $kasKecilModel->countAllResults() + 1;
            $nomor = 'KK' . str_pad($valNumb, 4, "0", STR_PAD_LEFT);

            $checkIsExist = $kasKecilModel->where('kk_nomor', $nomor)->first();
            if ($checkIsExist) {
                $lastRow = $kasKecilModel->orderBy('kk_nomor', 'DESC')->findAll(1);
---
SELECT COUNT(*) AS `numrows`
FROM `kas_kecil`
SELECT *
FROM `kas_kecil`
WHERE `kk_nomor` = 'KK0178'
 LIMIT 1
SELECT *
FROM `kas_kecil`
ORDER BY `kk_nomor` DESC
 LIMIT 1

                            <option value="">:: PILIH ::</option>
                            <?php
                            $userModel = new \App\Models\UserModel();
                            foreach ($userModel->orderBy('usr_nama', 'ASC')->findAll() as $row) { ?>
---
SELECT *
FROM `user`
ORDER BY `usr_nama` ASC

                        <select name="debet" id="debet" class="form-control <?= $validation->hasError('debet') ? 'is-invalid' : ''; ?> selectpicker" data-live-search="true">
                            <option value="" data-tokens="">:: PILIH ::</option>
                            <?php
                            foreach ($rekeningModel->orderBy('rek_kode', 'ASC')->findAll() as $row) { ?>
---
SELECT *
FROM `rekening`
ORDER BY `rek_kode` ASC

                        <select name="kredit" id="kredit" class="form-control <?= $validation->hasError('kredit') ? 'is-invalid' : ''; ?> selectpicker" data-live-search="true">
                            <option value="" data-tokens="">:: PILIH ::</option>
                            <?php
                            foreach ($rekeningModel->orderBy('rek_kode', 'ASC')->findAll() as $row) { ?>
---
SELECT *
FROM `rekening`
ORDER BY `rek_kode` ASC