app/Views/dashboard/editUbk.php

SELECT *
FROM `trxupah_bayar`
WHERE `tub_trxupah` = '3'
---
$rekeningModel = new \App\Models\KoderekeningModel();
$kkModel = new \App\Models\KasKecilModel();

$pembayaran = $trxupahBayarModel->where(['tub_trxupah' => $trxupah['tu_id']])->findAll();

SELECT `kas_kecil`.*, `user`.`usr_nama`
FROM `kas_kecil`
LEFT JOIN `user` ON `user`.`usr_id` = `kas_kecil`.`kk_user`
WHERE `kas_kecil`.`kk_status` = 1
AND `kas_kecil`.`kk_jenis` = 4
ORDER BY `kas_kecil`.`kk_tanggal` DESC
SELECT *
FROM `tukang`
ORDER BY `tk_nama` ASC
SELECT `upah`.*, `satuan`.`satuan_nama`, `kategori_barang`.`kabar_nama`
FROM `upah`
LEFT JOIN `satuan` ON `satuan`.`satuan_id` = `upah`.`up_satuan`
LEFT JOIN `kategori_barang` ON `kategori_barang`.`kabar_id` = `upah`.`up_kategori`
ORDER BY `upah`.`up_nama` ASC
SELECT `unit`.*, `types`.`type_nama`
FROM `unit`
LEFT JOIN `types` ON `types`.`type_id` = `unit`.`unit_tipe`
ORDER BY `unit`.`unit_nama` ASC
---
    $totalBayar += $bayar;
}

$kasKecil = $kkModel->join('user', 'user.usr_id = kas_kecil.kk_user', 'left')
    ->where(['kas_kecil.kk_status' => 1, 'kas_kecil.kk_jenis' => 4])
    ->select('kas_kecil.*, user.usr_nama')
    ->orderBy('kas_kecil.kk_tanggal', 'DESC')->findAll();

$tukang = $tukangModel->orderBy('tk_nama', 'ASC')->findAll();
$upah = $upahModel->join('satuan', 'satuan.satuan_id = upah.up_satuan', 'left')
    ->join('kategori_barang', 'kategori_barang.kabar_id = upah.up_kategori', 'left')
    ->select('upah.*, satuan.satuan_nama, kategori_barang.kabar_nama')
    ->orderBy('upah.up_nama', 'ASC')->findAll();
$unit = $unitModel->join('types', 'types.type_id = unit.unit_tipe', 'left')
    ->select('unit.*, types.type_nama')
    ->orderBy('unit.unit_nama', 'ASC')->findAll();

SELECT *
FROM `rekening`
ORDER BY `rek_kode` ASC
---
                                <select name="debet" id="debet" class="form-control form-control-sm <?= $validation->hasError('debet') ? 'is-invalid' : ''; ?> selectpicker" data-live-search="true">
                                    <option value="" data-tokens="">:: PILIH ::</option>
                                    <?php
                                    foreach ($rekeningModel->orderBy('rek_kode', 'ASC')->findAll() as $row) { ?>

SELECT *
FROM `rekening`
ORDER BY `rek_kode` ASC
---
                                <select name="kredit" id="kredit" class="form-control form-control-sm <?= $validation->hasError('kredit') ? 'is-invalid' : ''; ?> selectpicker" data-live-search="true">
                                    <option value="" data-tokens="">:: PILIH ::</option>
                                    <?php
                                    foreach ($rekeningModel->orderBy('rek_kode', 'ASC')->findAll() as $row) { ?>

SELECT *
FROM `rekening`
ORDER BY `rek_kode` ASC
---
                            <select name="debetLain" id="debetLain" class="form-control form-control-sm <?= $validation->hasError('debetLain') ? 'is-invalid' : ''; ?> selectpicker" data-live-search="true">
                                <option value="" data-tokens="">:: PILIH ::</option>
                                <?php
                                foreach ($rekeningModel->orderBy('rek_kode', 'ASC')->findAll() as $row) { ?>

SELECT *
FROM `rekening`
ORDER BY `rek_kode` ASC
---
                            <select name="kreditLain" id="kreditLain" class="form-control form-control-sm <?= $validation->hasError('kreditLain') ? 'is-invalid' : ''; ?> selectpicker" data-live-search="true">
                                <option value="" data-tokens="">:: PILIH ::</option>
                                <?php
                                foreach ($rekeningModel->orderBy('rek_kode', 'ASC')->findAll() as $row) { ?>

SELECT `kas_kecil`.*, `user`.`usr_nama`
FROM `kas_kecil`
LEFT JOIN `user` ON `user`.`usr_id` = `kas_kecil`.`kk_user`
WHERE `kk_id` = '89'
 LIMIT 1
SELECT *
FROM `rekening`
WHERE `rekening`.`rek_id` = '694'
SELECT *
FROM `rekening`
WHERE `rekening`.`rek_id` = '656'
---
                                        $totalLembur += str_replace(',', '.', $row['tul_nominal']);
                                    }

                                    $kasKecilbon = $kasKecilModel->where('kk_id', $row['tul_kaskecil'])
                                        ->join('user', 'user.usr_id = kas_kecil.kk_user', 'left')
                                        ->select('kas_kecil.*, user.usr_nama')->first();
                                    $rekeningDebet = $koderekeningModel->find($row['tul_debet']);
                                    $rekeningKredit = $koderekeningModel->find($row['tul_kredit']);