app/Views/dashboard/home.php

SELECT *
FROM `setting`
WHERE `setting`.`setting_id` = 1
---
<?= $this->section('content'); ?>
<?php
$settingModel = new \App\Models\SettingModel();
$setting = $settingModel->find(1);