app/Views/dashboard/rekening.php

<?php
$sesiBagian = session()->get('usr_bagian');
$bagianModel = new \App\Models\BagianModel();
$bagianAccess = $bagianModel->find($sesiBagian);
---
SELECT *
FROM `bagian`
WHERE `bagian`.`bagian_id` = '1'