app/Views/dashboard/ubk.php

SELECT *
FROM `tukang`
ORDER BY `tk_nama` ASC
SELECT `unit`.*, `types`.`type_nama`
FROM `unit`
LEFT JOIN `types` ON `types`.`type_id` = `unit`.`unit_tipe`
ORDER BY `unit`.`unit_nama` ASC
---
$trxupahModel = new \App\Models\TrxupahModel();
$trxupahItemModel = new \App\Models\TrxupahItemModel();

$tukang = $tukangModel->orderBy('tk_nama', 'ASC')->findAll();

$units = $unitModel->join('types', 'types.type_id = unit.unit_tipe', 'left')
    ->select('unit.*, types.type_nama')
    ->orderBy('unit.unit_nama', 'ASC')->findAll();