app/Views/auth/login.php

<?php
$settingModel = new \App\Models\SettingModel();
$setting = $settingModel->find(1);
---
SELECT *
FROM `setting`
WHERE `setting`.`setting_id` = 1