app/Models/TrxupahBayarModel.php

    public function totalBayarUpah($trxupahId)
    {
        $totalBayar = 0;
        $pembayaran = $this->where(['tub_trxupah' => $trxupahId])->findAll();
---
SELECT *
FROM `trxupah_bayar`
WHERE `tub_trxupah` = '3'