app/Models/UserModel.php

SELECT *
FROM `user`
WHERE `usr_username` = 'admin'
OR `usr_email` = 'admin'
 LIMIT 1
---
	public function login($user, $password)
	{
		$user = $this->where(['usr_username' => $user])->orWhere(['usr_email' => $user])->first();